---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.Append(Autodesk.Revit.DB.ModelCurve)
source: html/6e0c14c8-3795-7aff-8efc-fd10ef8485ee.htm
---
# Autodesk.Revit.DB.ModelCurveArray.Append Method

Add the model curve to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	ModelCurve item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ModelCurve`) - The model curve to be added.